import config from '../config.js';

export default {
    [config.title]: config.title,
    '主页': '主页',
    '小说': '小说',
    '书库': '书库',
    '书架': '书架',
    '关于': '关于',
    '设置': '设置',
    '搜索': '搜索',
    '章节': '章节',
    '小说详情': '小说详情',
    '页面未找到': '页面未找到',
    
    '确定': '确定',
    '清除': '清除',
    
    
    '标签': '标签',
    '友情链接': '友情链接',
    
    '热门精选': '热门精选',
    '查看更多': '查看更多',
    '随便来点': '随便来点',
    '随机': '随机',
    '刷新一下': '刷新一下',
    '最新小说': '最新小说',
    '种族': '种族',
    '虎': '虎',
    '龙': '龙',
    '狼': '狼',
    '熊': '熊',
    '狗': '狗',
    '猫': '猫',
    
}
