import config from '../config.js';

export default {
    [config.title]: config.title,
    '主页': '主页',
    '小说': '小说',
    '书库': '书库',
    '书架': '书架',
    '关于': '关于',
    '设置': '设置',
    '搜索': '搜索',
    '章节': '章节',
    '小说详情': '小说详情',
    '页面未找到': '页面未找到',
    
    '确定': '确定',
    '清除': '清除',
    
    '标签': '标签',
    '友情链接': '友情链接',
    
    '原文': '原文',
    '翻译': '翻译',
    '夜间': '夜间',
    '明亮': '明亮',
    '自动': '自动',
    
    '中文': '中文',
    '英语': '英语',
    '日语': '日语',
    '韩语': '韩语',
    
    '添加': '添加',
    '删除': '删除',
    
    //index.vue
    '热门精选': '热门精选',
    '查看更多': '查看更多',
    '随便来点': '随便来点',
    '随机': '随机',
    '刷新一下': '刷新一下',
    '最新小说': '最新小说',
    '种族': '种族',
    
    
    
    //默认Tags
    '兽人': '兽人',
    'AI生成': 'AI生成',
    '冒险': '冒险',
    '同人': '同人',
    '爪子': '爪子',
    '动物': '动物',
    '恋爱': '恋爱',
    '纯爱': '纯爱',
    '日常': '日常',
    '清水': '清水',
    '幻想': '幻想',
    '虎': '虎',
    '龙': '龙',
    '狼': '狼',
    '熊': '熊',
    '狗': '狗',
    '猫': '猫',
    
    //bookmark.vue
    '书架为空': '书架为空',
    '书架为空，快去添加一些小说吧！': '书架为空，快去添加一些小说吧！',
    
    //chapter.vue
    '加载中...': '加载中...',
    '上一章': '上一章',
    '下一章': '下一章',
    '目录': '目录',
    '字体': '字体',
    '字体大小': '字体大小',
    '背景颜色': '背景颜色',
    '字体颜色': '字体颜色',
    '边距': '边距',
    '微软雅黑': '微软雅黑',
    'MiSans': 'MiSans',
    '思源黑体': '思源黑体',
    '黑体': '黑体',
    '宋体': '宋体',
    '楷体': '楷体',
    '仿宋': '仿宋',
    
    //error.vue
    '我们可能遇到了一些问题，无法找到这个页面。': '我们可能遇到了一些问题，无法找到这个页面。',
    '请再试一次或': '请再试一次或',
    '返回主页': '返回主页',
    '猜你喜欢': '猜你喜欢',
    
    //info.vue
    '来源': '来源',
    '%d章': '%d章',
    '%d浏览': '%d浏览',
    '作者：': '作者：',
    '作者：%s': '作者：%s',
    '作者未知': '作者未知',
    '更新时间：': '更新时间：',
    '原&nbsp;文': '原&nbsp;文',
    '翻&nbsp;译': '翻&nbsp;译',
    '加入书架': '加入书架',
    '从书架移除': '从书架移除',
    '立即阅读': '立即阅读',
    '继续阅读': '继续阅读',
    '最新章节': '最新章节',
    '简介': '简介',
    '评论': '评论',
    
    //list.vue
    '热门小说': '热门小说',
    '最新': '最新',
    '热门': '热门',
    '条件筛选': '条件筛选',
    '请输入关键字：小说名、作者名、简介等': '请输入关键字：小说名、作者名、简介等',
    
    //settings.vue
    '偏好设置': '偏好设置',
    '基本设置': '基本设置',
    '安全模式': '安全模式',
    '列表将不会显示不适合工作时间的内容': '列表将不会显示不适合工作时间的内容',
    '主题模式': '主题模式',
    '自动切换主题模式': '自动切换主题模式',
    '语言偏好': '语言偏好',
    '隐藏语言': '隐藏语言',
    '选择不想看到的语言': '选择不想看到的语言',
    '自动翻译': '自动翻译',
    '自动翻译小说内容': '自动翻译小说内容',
    '翻译到...': '翻译到...',
    '选择翻译到的语言': '选择翻译到的语言',
    '内容偏好': '内容偏好',
    '隐藏标签': '隐藏标签',
    '添加不想看到的标签': '添加不想看到的标签',
    
    //AppInfo.vue
    '发现新的版本，点击更新': '发现新的版本，点击更新',
    '当前处于离线状态': '当前处于离线状态',
    'PWA版本现已可用': 'PWA版本现已可用',
    '立即安装': '立即安装',
    '不再提示': '不再提示',
    
    //Footer.vue
    '关于我们': '关于我们',
    '网站状态': '网站状态',
    '联系我们': '联系我们',
    '站点地图': '站点地图',
    
    //NovelList.vue
    '无': '无',
    '最新章节：%s': '最新章节：%s',
    
    //Slogan.vue
    '最新最全的小说网站': '最新最全的小说网站',
}
